const HIRAGANA_2D = [
    ["あ", "い", "う", "え", "お"], // a
    ["か", "き", "く", "け", "こ"], // ka
    ["さ", "し", "す", "せ", "そ"], // sa
    ["た", "ち", "つ", "て", "と"], // ta
    ["な", "に", "ぬ", "ね", "の"], // na
    ["は", "ひ", "ふ", "へ", "ほ"], // ha
    ["ま", "み", "む", "め", "も"], // ma
    ["ら", "り", "る", "れ", "ろ"], // ra
    ["が", "ぎ", "ぐ", "げ", "ご"], // ga
    ["ざ", "じ", "ず", "ぜ", "ぞ"], // za
    ["だ", "ぢ", "づ", "で", "ど"], // da
    ["ば", "び", "ぶ", "べ", "ぼ"], // ba
    ["ぱ", "ぴ", "ぷ", "ぺ", "ぽ"], // pa
    ["や", "", "ゆ", "", "よ"], // ya (không có yi, ye)
    ["わ", "", "", "", "を"], // wa
    ["ゃ", "", "ゅ", "", "ょ"], // small ya yu yo
    ["ん"], // n
    ["っ"], // small tsu
];

const HIRAGANA_2DD = [
    ["あ", "い", "う", "え", "お"], // a
    ["か", "き", "く", "け", "こ"], // ka
    ["さ", "し", "す", "せ", "そ"], // sa
    ["た", "ち", "つ", "て", "と"], // ta
    ["な", "に", "ぬ", "ね", "の"], // na
    ["は", "ひ", "ふ", "へ", "ほ"], // ha
    ["ま", "み", "む", "め", "も"], // ma
    ["ら", "り", "る", "れ", "ろ"], // ra
    ["わ", "を", "ん", "〃", "○"], // wa
    ["ゃ", "ゅ", "ょ", "っ", ""], // small ya yu yo
];

const HIRAGANA_2DX = [
    ["あ", "か", "さ", "た", "な", "は", "ま", "ら"],
    ["い", "き", "し", "ち", "に", "ひ", "み", "り"],
    ["う", "く", "す", "つ", "ぬ", "ふ", "む", "る"],
    ["え", "け", "せ", "て", "ね", "へ", "め", "れ"],
    ["お", "こ", "そ", "と", "の", "ほ", "も", "ろ"],
    ["〃", "○", "ん", "わ", "を", "ゃ", "ゅ", "ょ", "っ"],
];

const HIRAGANA_2DY = [
    ["あ", "か", "さ", "た", "な", "は", "ま", "ら"],
    ["い", "き", "し", "ち", "に", "ひ", "み", "り"],
    ["う", "く", "す", "つ", "ぬ", "ふ", "む", "る"],
    ["え", "け", "せ", "て", "ね", "へ", "め", "れ"],
    ["お", "こ", "そ", "と", "の", "ほ", "も", "ろ"],
    ["〃", "○", "ん", "わ", "を", "ゃ", "ゅ", "ょ", "っ"],
];

const box = document.querySelector(`.textbox`);
const keyboard = document.querySelector(`.keyboard`);

function renderKeyboard() {
    let html = ``;

    for (let row of HIRAGANA_2DX) {
        let rowHtml = ``;
        for (let letter of row) {
            rowHtml += ` <div class="keyboard-letter">${letter}</div>`;
        }

        html += `
        <div class="keyboard-row">${rowHtml}</div>`;
    }

    keyboard.innerHTML = html;
}

renderKeyboard();
